# tapping

tap 'homebrew/boneyard'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/core'
brew "mas"

# Security
cask "1password"

# Computer Hygeine
cask "cleanmymac"
cask "daisydisk"
cask "onyx"
cask "hazel"
mas 'Blackmagic Disk Speed Test', id: 425264550

# Productivity tools 
cask "alfred" # file opener
mas 'Things 3', id: 904280696 # https://itunes.apple.com/us/app/things-3/id904280696?mt=12
cask "keyboard-maestro" # manages keyboard shortcuts
cask "caffeine" # keeps mac alive 
cask "google-chrome" # the boss browser
cask "dropbox" # file sharing
mas 'MindNode', id: 992076693 # mind notes
cask "textmate" # text editor of choice
cask "rescuetime" # get stats on productivity
cask "firefox"
cask "skitch"
mas 'Magnet', id: 441258766 # https://itunes.apple.com/us/app/magnet/id441258766?mt=12, Window management
mas 'The Unarchiver', id: 425424353
mas 'Microsoft OneNote', id: 784801555
mas 'Evernote', id: 406056744
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
cask "textexpander"

# design tools
cask "adobe-creative-cloud" # creative tools at fb
mas 'OmniGraffle 7', id: 1142578753 # https://itunes.apple.com/us/app/omnigraffle-7/id1142578753?mt=12
mas 'iMovie', id: 408981434

# communication
cask "blue-jeans" # meeting tool at fb 
cask "whatsapp"

# general computer programming
cask "iterm2"
cask "atom"
brew "zsh"
brew "git"
brew "python"
brew "ruby"

# iOS development
cask "charles"
cask "xscope"

# web development
cask "chrome-devtools"

# reading
mas 'Kindle', id: 405399194
mas 'Pocket', id: 568494494
mas 'Reeder', id: 880001334

# commandline tools

# Games

# mas 'Command & Conquer Generals Deluxe Edition', id: 912423770
# mas 'Cities In Motion Collection', id: 999210226
