# tapping

tap 'homebrew/boneyard'
tap 'homebrew/bundle'

# UI tools
tap 'caskroom/cask'
cask "chrome-devtools"
cask "google-chrome"
cask "steam"
cask "franz"
cask "github-desktop"
cask "the-unarchiver"
cask "xscope"
cask "whatsapp"
cask "textmate"
cask "rescuetime"
cask "clarify"
cask "mindnode-pro"
cask "kindle"
cask "evernote"
cask "flux"
cask "alfred"
cask "dropbox"
cask "iterm2"
cask "slate"
cask "crashplan"
cask "1password"
cask "firefox"
cask "onyx"
cask "skitch"
cask "skype"
cask "teamviewer"
cask "vlc"


# commandline tools
tap 'homebrew/core'
brew "openssl"
brew "boost"
brew "git"
brew "freetype"
brew "fcc"
brew "jpeg"
brew "libxml2"
brew "libyaml"
brew "mysql"
brew "node"
brew "python"
brew "readline"
brew "ruby"
brew "sqlite"
brew "swiftlint"
brew "tig"
brew "xcproj"
brew "libxml2"
brew "gdbm"
brew "mas"

mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
mas 'Twitter', id: 409789998
mas 'Microsoft OneNote', id: 784801555
mas 'Evernote', id: 406056744
mas 'Kindle', id: 405399194
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Wunderlist', id: 410628904
mas 'Pocket', id: 568494494
mas 'Pages', id: 409201541
mas 'Reeder', id: 880001334
mas 'Textual', id: 896450579
mas 'Blackmagic Disk Speed Test', id: 425264550
mas 'MindNode', id: 992076693
mas 'Numbers', id: 409203825

# Games

# mas 'Command & Conquer Generals Deluxe Edition', id: 912423770
# mas 'Cities In Motion Collection', id: 999210226
